app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT 1  [["title", "The Incredibles"]]
---
  def similar_movies
    @similar_movies = Movie.find_similar_movies(params[:title])